toroidal_rov_thruster/prototype2A_M2_openFOAM/0.orig/nut
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}

// Turbulent viscosity, m2/s. Calculated by the turbulence model.

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }

    farfield
    {
        type            calculated;
        value           uniform 0;
    }

    outlet
    {
        type            calculated;
        value           uniform 0;
    }

    rotor
    {
        type            nutUSpaldingWallFunction;
        value           uniform 0;
    }

    stator
    {
        type            nutUSpaldingWallFunction;
        value           uniform 0;
    }
}
