toroidal_rov_thruster/prototype2A_M2_openFOAM/0.orig/p
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}

// Kinematic pressure: p = pressure / density, in m2/s2. Multiply by 1025 for Pa.

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    // Still water far away: total pressure 0 where water flows in.
    inlet
    {
        type            totalPressure;
        p0              uniform 0;
        value           uniform 0;
    }

    farfield
    {
        type            totalPressure;
        p0              uniform 0;
        value           uniform 0;
    }

    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }

    rotor
    {
        type            zeroGradient;
    }

    stator
    {
        type            zeroGradient;
    }
}
