toroidal_rov_thruster/prototype2A_M2_openFOAM/constant/transportProperties
FoamFile { format ascii; class dictionary; object transportProperties; }
transportModel Newtonian;
nu [0 2 -1 0 0 0 0] 1.05e-6;

