toroidal_rov_thruster/prototype2A_M2_openFOAM/constant/turbulenceProperties
FoamFile { format ascii; class dictionary; object turbulenceProperties; }
simulationType RAS;
RAS { RASModel kOmegaSST; turbulence on; printCoeffs on; }

