toroidal_rov_thruster/prototype2A_M2_openFOAM/system/blockMeshDict.template
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// Background mesh: one box from x = -0.5 to +1.0 m (5 D upstream, 10 D downstream of the
// 100 mm rotor) and 1.0 m square (5 D radius), as recommended after the 1B-14 design A run.
// @NX@ @NY@ @NZ@ are filled in by scripts/configure_mesh.py.
convertToMeters 1;

vertices
(
    (-0.5 -0.5 -0.5) (1.0 -0.5 -0.5) (1.0 0.5 -0.5) (-0.5 0.5 -0.5)
    (-0.5 -0.5  0.5) (1.0 -0.5  0.5) (1.0 0.5  0.5) (-0.5 0.5  0.5)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (@NX@ @NY@ @NZ@) simpleGrading (1 1 1)
);

edges ();

boundary
(
    inlet    { type patch; faces ((0 4 7 3)); }
    outlet   { type patch; faces ((1 2 6 5)); }
    // Open sides, so the thruster can draw water in from all around.
    // The four faces point in different directions, so v2412 refuses them
    // as a single symmetryPlane patch.
    farfield { type patch; faces ((0 1 5 4) (3 7 6 2) (0 3 2 1) (4 5 6 7)); }
);

mergePatchPairs ();
