toroidal_rov_thruster/prototype2A_M2_openFOAM/system/surfaceFeatureExtractDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeatureExtractDict;
}

// Sharp edges (blade trailing edges, duct lips, strut edges) that snappyHexMesh should keep.
rotor_p2a.stl
{
    extractionMethod    extractFromSurface;
    includedAngle       150;
    writeObj            yes;
}

stator_p2a.stl
{
    extractionMethod    extractFromSurface;
    includedAngle       150;
    writeObj            yes;
}
